Revit 2027 API
BuiltInFailures.AnalyticalAutomationFailures.EmptySelection Property
 There are no selected elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EmptySelection { get; }
Public Shared ReadOnly Property EmptySelection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EmptySelection {
	FailureDefinitionId^ get ();
}
static member EmptySelection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalAutomationFailures Class
Autodesk.Revit.DB Namespace